cf/DataProcessors/ПроведениеПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПроведениеПоПартиям</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОшибокПартионногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПартии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/ВидыОшибокПартионногоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОшибокПартионногоУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказанИнвойс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеНовойНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателяНеизвестногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеБезЦены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледствиеПредыдущейОшибки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запчасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/Комплектация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Комплектация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКомплектацияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииТовараШапки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ОприходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОприходованиеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.Инвентаризация</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ЯчеестаяИнвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвентаризация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВИтогахИнвентаризации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/DataProcessors/ПроведениеПоПартиям/Forms/ОшибкиРасчетаСебестоимости/Ext/Form/Module.bsl
&НаСервере
Процедура КоличествоЗаписейНаСервере()
	
	Запрос=Новый Запрос("Выбрать ""Всего записей"" Показатель, количество(*) Количество из РегистрНакопления.ПартииТоваров
	|объединить все
	
	|Выбрать ""из них не указан инвойс"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.НеУказанИнвойс)
	|объединить все
	
	|Выбрать ""из них не указан инвойс"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.НеУказанИнвойс)
	|объединить все
	
	|Выбрать ""из них оприходование не закупавшейся ранее номенклатуры"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.ОприходованиеНовойНоменклатуры)
	|объединить все
	
	|Выбрать ""из них отсутствие необходимого количества"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.ОтсутствиеНоменклатуры)
	|объединить все
	
	|Выбрать ""из них возврат от покупателя товара который не продавался"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.ВозвратОтПокупателяНеизвестногоТовара)
	|объединить все
	
	|Выбрать ""из них с нулевой суммой (все виды ошибок)"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ Сумма=0
	|объединить все
	
	|Выбрать ""из них с нулевой суммой на текущих остатках"", количество(*) из РегистрНакопления.ПартииТоваров.Остатки ГДЕ СуммаОстаток=0
	|объединить все
	
	|выбрать ""из них поступления без цен"", Количество(*)
	|из
	|документ.ПоступлениеТоваров.Товары
	|ГДЕ Ссылка.Сумма=0 и Ссылка.Проведен
	
	|объединить все
	
	|выбрать ""из них разукомлектации товара, который никогда не приобретался"",Количество(*)
	|из регистрНакопления.ПартииТоваров
	|ГДЕ Сумма=0
	|и Регистратор ссылка документ.Комплектация
	|и Выразить(Регистратор КАК Документ.Комплектация).Операция = Значение(Перечисление.ВидыоперацийКомплектацияНоменклатуры.РазуКомплектация) 
	|и НЕ Номенклатура.ТипНоменклатуры=Значение(Перечисление.ТипыНоменклатуры.Услуга)
	
	|объединить все
	
	|выбрать ""из них оприходование товара, который никогда не приобретался"",Количество(*)
	|из регистрНакопления.ПартииТоваров
	|ГДЕ Сумма=0
	|и Регистратор ссылка документ.ОприходованиеТоваров
	|и НЕ Номенклатура.ТипНоменклатуры=Значение(Перечисление.ТипыНоменклатуры.Услуга)
	
	|объединить все
	
	|выбрать ""из них расчеты себестоимости без привязки к инвойсам"", Количество(*)
	|из
	|документ.РасчетСебестоимости.Себестоимость
	|ГДЕ 
	|Ссылка.проведен
	|и Ссылка.Инвойс=Значение(Документ.Инвойс.ПустаяСсылка)
	
	|объединить все
	
	|выбрать ""из них расчеты себестоимости без привязки к инвойсам, имеющиеся в текущих остатках"", Количество(*)
	|из
	|документ.РасчетСебестоимости.Себестоимость Рег
	|внутреннее соединение РегистрНакопления.ПартииТоваров.Остатки Ост По Ост.Номенклатура=Рег.Номенклатура
	|ГДЕ 
	|Ссылка.проведен
	|и Ссылка.Инвойс=Значение(Документ.Инвойс.ПустаяСсылка)
	|;");
	
	
	ТабПодсчета.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ТекДата='20120101';
	Пока ТекДата<=НачалоГода(ТекущаяДата()) Цикл
		Запрос=Новый Запрос("Выбрать количество(*) Колво из РегистрНакопления.ПартииТоваров ГДЕ Сумма=0 и Период>=&НачДата и Период<=&КонДата");
		Запрос.УстановитьПараметр("НачДата",НачалоГода(ТекДата));
		Запрос.УстановитьПараметр("КонДата",КонецГода(ТекДата));
			
		НовСтр=ТабПодсчета.Добавить();
		НовСтр.Показатель="из них с нулевой суммой за "+Год(ТекДата);
		НовСтр.Количество = Запрос.Выполнить().Выгрузить()[0].Колво;
		
		ТекДата=ДобавитьМесяц(ТекДата,12);
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаписей(Команда)
	КоличествоЗаписейНаСервере();
КонецПроцедуры
